CREATE DATABASE  IF NOT EXISTS `joldb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `joldb`;
-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: 139.162.97.43    Database: joldb
-- ------------------------------------------------------
-- Server version	8.0.34-0ubuntu0.22.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `jol_product`
--

DROP TABLE IF EXISTS `jol_product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `jol_product` (
  `prodId` int NOT NULL AUTO_INCREMENT,
  `name` char(50) NOT NULL,
  `descript` char(255) DEFAULT NULL,
  `createDt` datetime NOT NULL,
  `updateDt` datetime NOT NULL,
  `price` int NOT NULL,
  `cost` int DEFAULT NULL,
  `qty` int DEFAULT NULL,
  `category` char(20) NOT NULL,
  `imgURL` varchar(150) DEFAULT NULL,
  `sizeInfo` char(15) DEFAULT NULL,
  `series` char(15) DEFAULT NULL,
  PRIMARY KEY (`prodId`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jol_product`
--

LOCK TABLES `jol_product` WRITE;
/*!40000 ALTER TABLE `jol_product` DISABLE KEYS */;
INSERT INTO `jol_product` VALUES (1,'柔彈慵懶針織衫上衣','<p><br/>此款版型寬鬆<br>鬆軟親膚針織面料<br>*實品顏色一單品照為主<br>尼龍10% 聚丙烯纖維90%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-07 00:00:00','2023-05-07 00:00:00',390,233,54,'1','/image/101.jpg,/image/102.jpg','S,M,L','sales'),(2,'MIT 法式logo細肩BraTop','<p><br/>此款版型合身，基於衛生考量無法提供退貨<br>輕盈鬆軟極親膚布料/可調可拆式肩帶<br><br>*實品顏色一單品照為主<br>聚丙烯57% 棉38% 彈性纖維5%<br>厚薄:適中<br>彈性:佳<br><br>素材產地 /台灣<br>加工產地 /台灣<br></p>','2023-05-09 00:00:00','2023-05-09 00:00:00',399,250,12,'1','/image/201.jpg,/image/202.jpg','S,M,L','sales'),(3,'A\' 日常刺繡logo短版tee','<p><br>此款版型合身<br>冰涼清膚面料/窄肩合身版型/穿著收腰修飾身形<br><br>*實品顏色一單品照為主<br>棉95% 彈性纖維5%<br>厚薄:薄<br>彈性:佳<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-09 00:00:00','2023-05-09 00:00:00',299,160,12,'1','/image/301.jpg,/image/302.jpg','S,M,L','sales'),(4,'小直筒九分彈性牛仔褲','<p><br>此款版型適中高腰合身直筒褲型，9分褲長<br>舒適微彈性牛仔布料/布料內刷毛/修身小直筒九分褲版型/中高腰版型<br><br>*實品顏色一單品照為主<br>棉98% 彈性纖維2%<br>厚薄:適中<br>彈性:適中<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-09 00:00:00','2023-05-09 00:00:00',799,450,188,'2','/image/401.jpg,/image/402.jpg','S,M,L','sales'),(5,'MIT Holiday Lover 貓咪印花Tee','<p><br>此款版型寬鬆<br>MIT台灣製造/舒服厚磅棉質布料/可愛貓咪印花Tee<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:適中<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',599,400,120,'1','/image/501.jpg,/image/502.jpg','S,M,L','sales'),(6,'時髦綁帶美背洋裝','<p><br>此款版型適中<br>綁帶造型/可調式肩帶/美背造型<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',399,120,50,'3','/image/601.jpg,/image/602.jpg','S,M,L','sales'),(7,'棉麻澎澎袖綁帶上衣','<p><br>此款版型適中<br>澎澎棉麻布料/前綁帶可自行調整<br><br>*實品顏色一單品照為主<br>棉麻100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',298,100,13,'1','/image/701.jpg,/image/702.jpg','S,M,L','sales'),(8,'立體粗編織微削肩背心','<p><br>此款版型適中<br>直條編織造型/可單穿外搭<br><br>*實品顏色一單品照為主<br>聚丙烯纖維100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,345,44,'1','/image/801.jpg,/image/802.jpg','S,M,L','sales'),(9,'透膚感波浪圓領上衣','<p><br>此款版型適中<br>舒適布料不刺膚/整件有彈性好穿脫<br><br>*實品顏色一單品照為主<br>聚酯纖維100%<br>厚薄:薄<br>彈性:佳<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',780,339,40,'1','/image/901.jpg,/image/902.jpg','S,M,L','sales'),(10,'澎袖荷葉領短襯衫','<p><br>此款版型適中<br>荷葉領大澎袖造型/短版顯腰身<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',540,236,50,'1','/image/1001.jpg,/image/1002.jpg','S,M,L','sales'),(11,'寬肩後開岔西裝外套','<p><br>此款版型寬鬆<br>質感挺版西裝面料/寬肩寬鬆版型/後兩側開岔/有墊肩/有內裡<br><br>*實品顏色一單品照為主<br>聚酯纖維74% 棉20% 彈性纖維5%<br>厚薄:厚<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',299,100,29,'1','/image/1101.jpg,/image/1102.jpg','S,M,L','sales'),(12,'男友落地牛仔吊帶褲','<p><br>此款版型適中<br>厚磅挺感布料/前上身、兩側及後面有口袋/可調式肩帶<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',499,283,30,'3','/image/1201.jpg,/image/1202.jpg','S,M,L','new'),(13,'柔滑涼感絲鬆緊長腿褲','<p><br>此款版型略寬鬆<br>極嫩柔滑舒適面料/夏日清涼手感/鬆緊腰頭設計<br><br>*實品顏色一單品照為主<br>聚酯纖維100%<br>厚薄:薄<br>彈性:適中<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,400,34,'2','/image/1301.jpg,/image/1302.jpg','S,M,L','sport'),(14,'MIT 超舒適涼感彈力內搭褲(涼感紗)','<p><br>此款版型合身*基於衛生考量無法提供退貨服務<br>台灣製造/自訂開發布料/涼感絲滑牛奶絲/特殊顯瘦剪裁<br><br>*實品顏色一單品照為主<br>尼龍84% 彈性纖維16%<br>厚薄:適中<br>彈性:佳<br><br>素材產地 /台灣<br>加工產地 /台灣<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',399,123,47,'2','/image/1401.jpg,/image/1402.jpg','S,M,L','sport'),(15,'MIT 超彈力運動緊身褲','<p><br>此款版型合身*基於衛生考量無法提供退貨服務<br>台灣製造/四面彈力運動布料/包覆性強/包小腹款<br><br>*實品顏色一單品照為主<br>聚酯纖維84% 彈性纖維16%<br>厚薄:適中<br>彈性:佳<br><br>素材產地 /台灣<br>加工產地 /台灣<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',499,150,33,'2','/image/1501.jpg,/image/1502.jpg','S,M,L','sport'),(16,'MIT 零著感牛奶絲短褲(涼感紗)','<p><br>此款版型適中<br>親膚華面牛奶絲/柔軟內裡/涼感成分面料<br><br>*實品顏色一單品照為主<br>棉76% 聚酯纖維24%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',399,178,45,'2','/image/1601.jpg,/image/1602.jpg','S,M,L','sport'),(17,'品牌寬摺小圓裙','<p><br>此款版型適中<br>後鬆緊彈性/百褶圓弧設計/修飾腰腹<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:適中<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',790,450,24,'2','/image/1701.jpg,/image/1702.jpg','S,M,L','new'),(18,'A\'a刺繡長腿斜紋牛仔褲','<p><br>此款中腰寬褲版型，褲長落地<br>舒適挺料斜紋牛仔布料/A\'a小法式刺繡設計/長腿寬褲剪裁修飾腿型<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',1290,789,55,'2','/image/1801.jpg,/image/1802.jpg','S,M,L','new'),(19,'小香毛呢細肩洋裝','<p><br>此款版型適中<br>彈性細肩帶/質感小香風毛呢布料/有內裡/側邊開隱形拉鍊<br><br>*實品顏色一單品照為主<br>聚酯纖維100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',1090,630,22,'3','/image/1901.jpg,/image/1902.jpg','S,M,L','new'),(20,'小香風排釦造型短洋裝','<p><br>此款版型適中<br>小香毛呢條紋面料/兩側口袋排扣設計/有內裡<br><br>*實品顏色一單品照為主<br>羊毛40% 聚酯纖維60%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',990,500,23,'3','/image/2001.jpg,/image/2002.jpg','S,M,L','new'),(21,'微透肌美背綁帶短洋裝','<p><br>此款版型適中<br>絲滑透膚滑面布料/澎袖剪裁設計/後挖洞綁帶造型/有內裡<br><br>*實品顏色一單品照為主<br>聚酯纖維100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',890,790,50,'3','/image/2101.jpg,/image/2102.jpg','S,M,L','new'),(22,'質感反摺褲頭修身短裙','<p><br>此款版型適中<br>質感挺版西裝布料/反摺腰頭造型設計/內裡為褲型設計<br><br>*實品顏色一單品照為主<br>聚酯纖維74% 棉20% 彈性纖維6%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,500,35,'2','/image/2201.jpg,/image/2202.jpg','S,M,L','new'),(23,'時髦及膝半身牛仔裙','<p><br>此款版型適中<br>挺版顯瘦丹寧布料/時髦修身及膝長度/後中下擺開岔<br><br>*實品顏色一單品照為主<br>棉80% 聚酯纖維20%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',890,640,35,'2','/image/2301.jpg,/image/2302.jpg','S,M,L','new'),(24,'MORE REAL 高彈力提臀四分運動褲','<p><br>此款版型合身*基於衛生考量無法提供退貨服務<br>運動瑜珈親膚高彈布料/收腹提臀/後腰下弧線設計/包覆性強<br><br>*實品顏色一單品照為主<br>尼龍76% 彈性纖維24%<br>厚薄:適中<br>彈性:佳<br><br>素材產地 /台灣<br>加工產地 /台灣<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',399,200,89,'2','/image/2401.jpg,/image/2402.jpg','S,M,L','sport'),(25,'& IN THING 時髦運動短褲','<p><br>此款版型適中<br>滑面斜紋布料/柔軟內裡/隱形口袋設計<br><br>*實品顏色一單品照為主<br>聚酯纖維74% 棉16%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',490,300,57,'2','/image/2501.jpg,/image/2502.jpg','S,M,L','sport'),(26,'MIT 品牌刺繡彈性羅紋五分褲','<p><br>此款版型合身<br>親膚柔軟面料/鬆緊腰頭/腰瘦俏臀必備<br><br>*實品顏色一單品照為主<br>尼龍70% 彈性纖維18% 聚酯纖維12%<br>厚薄:適中<br>彈性:佳<br><br>素材產地 /台灣<br>加工產地 /台灣<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',490,200,23,'2','/image/2601.jpg,/image/2602.jpg','S,M,L','sport'),(27,'日常小個性牛仔吊帶褲','<p><br>此款版型適中<br>厚磅挺感牛仔布料/兩側後面有口袋/可調式肩帶<br><br>*實品顏色一單品照為主<br>棉100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',1190,890,23,'3','/image/2701.jpg,/image/2702.jpg','S,M,L','new'),(28,'品牌LOGO環保托特兩用包','<p><br>此款版型適中<br>環保PU材質/品牌LOGO設計/手提肩背兩用背帶<br><br>*實品顏色一單品照為主<br>PU100%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',390,180,80,'4','/image/2801.jpg,/image/2802.jpg','F','new'),(29,'URBAN RESEARCH聯名款條紋帆布包','<p><br>此款版型適中<br>斜紋面料/聯名印花條紋設計/提袋不可調整長度/內附夾層<br><br>*實品顏色一單品照為主<br>棉100%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',490,270,100,'4','/image/2901.jpg,/image/2902.jpg','F','new'),(30,'品牌LOGO菱格紋立鋪棉包','<p><br>此款版型適中<br>壓線鋪棉設計/菱格Logo造型設計/內附暗袋<br><br>*實品顏色一單品照為主<br>棉100%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',590,389,100,'4','/image/3001.jpg,/image/3002.jpg','F','new'),(31,'細緻光澤立體花朵針式耳環','<p><br>*基於衛生考量無提供退貨服務<br>韓國直送/簍空花朵立體造型/針式耳環<br><br>*實品顏色一單品照為主<br>壓克力/合金<br><br>素材產地 /韓國<br>加工產地 /韓國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',299,100,70,'4','/image/3101.jpg,/image/3102.jpg','F','new'),(32,'品牌LOGO造型刷刷漁夫帽','<p><br>刷刷布面料/頭圍可微調/帽繩可拆<br><br>*實品顏色一單品照為主<br>聚酯纖維 100%<br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,299,80,'4','/image/3201.jpg,/image/3202.jpg','F','new'),(33,'夏日日常刺繡棒球帽','<p><br>刺繡棒球帽/帽圍可調節/小臉帽型<br><br>*實品顏色一單品照為主<br>棉 100%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,240,70,'4','/image/3301.jpg,/image/3302.jpg','F','new'),(34,'圓領透紗澎袖上衣','<p><br>此款版型寬鬆 高級透紗面料/親膚手感/袖口鬆緊設計/正反兩穿<br><br>*實品顏色一單品照為主<br>尼龍 100%<br>厚薄:薄<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',590,300,45,'1','/image/3401.jpg,/image/3402.jpg','S,M,L','new'),(35,'愛心釦簍空針織外套','<p><br>此款版型適中 親膚針織/愛心簍空小洞設計造型/立體珍珠排扣<br><br>*實品顏色一單品照為主<br>尼龍 10% 聚丙烯纖維90%<br>厚薄:適中<br>彈性:適中<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',890,600,50,'1','/image/3501.jpg,/image/3502.jpg','S,M,L','new'),(36,'率性設計感牛仔外套(寬鬆版)','<p><br>此款版型寬鬆 厚挺牛仔布料/造型立釦/袖子造型拼接設計/寬版造型/中性造型<br>成分以官網標示為主<br><br>*實品顏色一單品照為主<br>棉 80% 聚酯纖維20%<br>厚薄:適中<br>彈性:無<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',1390,890,30,'1','/image/3601.jpg,/image/3602.jpg','S,M,L','new'),(37,'時髦亮皮單肩包','<p><br>挺感亮皮布料/派對時尚單品/可手提或肩背/背帶無法調整長度<br><br>*實品顏色一單品照為主<br>合成皮 100%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',690,350,28,'4','/image/3701.jpg,/image/3702.jpg','F','new'),(38,'品牌經典鋪棉圍巾','<p><br>柔軟鋪棉布料/厚實親膚舒適保暖/交叉穿洞設計<br><br>*實品顏色一單品照為主<br>棉 100%<br><br>素材產地 /中國<br>加工產地 /中國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',590,389,20,'4','/image/3801.jpg,/image/3802.jpg','F','new'),(39,'立體麻花針織中筒襪','<p><br>*基於衛生考量無法提供退貨服務 韓國直送/柔軟針織面料/麻花編織造型/貼膚舒適<br><br>*實品顏色一單品照為主<br>棉 85% 彈性纖維<br><br>素材產地 /韓國<br>加工產地 /韓國<br></p>','2023-05-12 00:00:00','2023-05-12 00:00:00',190,100,70,'4','/image/3901.jpg,/image/3902.jpg','F','sales');
/*!40000 ALTER TABLE `jol_product` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-31 13:43:05
